/*****************************************************************
 *	文件名		：sop.h 
 *	文件功能	：SOP报文打包/拆包函数头文件
 *	编程者		：Tengqh
 *	初作时间	：2002/4/26
 *	版本		: 1.0
 *	--------------------------------------------------	
 *		时间				修改者		注释
 *		2002/4/26	        Tengqh		创建
 ****************************************************************/
#ifndef __SOP_H__

#define __SOP_H__

#define USE_COP		1

/* mapfile的所在目录 */
extern char g_sEucpMapFile[128];

/******************************************************
  模块名 : 初始化转换环境
  参  数 : iUseEucpFlag - 转换类型，固定为USE_COP
  返回值 : 0  - 成功
           <0 - 失败
******************************************************/
int InitConEnv(int iUseEucpFlag);

/******************************************************
  模块名 : 释放转换环境
  参  数 : 无
  返回值 : 无
******************************************************/
void DestoryConEnv(void);

/******************************************************
  模块名 : SOP报文拆包函数
  参  数 : pRecordBuf    - 报文
           iRecordBufLen - 报文长度
           pczPktFmt     - 报文格式
  返回值 : 0  - 成功
           <0 - 失败
  说  明 : pczPktFmt     - 报文格式
           格式文件名@格式类型
           格式类型: S - 上传报文，R - 下传报文
           比如: O61400@S，O61401@R
******************************************************/
int ConvertPktToPool(char * pRecordBuf,
                     int iRecordBufLen,
                     char *pczPktFmt);

/******************************************************
  模块名 : SOP报文打包函数
  参  数 : pRecordBuf    - 报文缓冲区
           iRecordBufLen - 报文缓冲区长度
           pczPktFmt     - 报文格式
  返回值 : 0  - 成功
           <0 - 失败
******************************************************/
int ConvertPoolToPkt(char * pRecordBuf,
                     int iRecordBufLen,
                     char *pczPktFmt);

/******************************************************
  模块名 : 在POOL池中放入一字符串数据
  参  数 : c_pczName    - 数据项的名字
           c_pczVal     - 数据项的值
  返回值 : 0  - 成功
           -1 - 失败
******************************************************/
int PPutStr(char *c_pczName,char *c_pczVal);

/******************************************************
  模块名 : 从POOL池中取出一字符串数据
  参  数 : c_pczName    - 数据项的名字
           c_pczBuf     - 数据缓冲区
           c_iBufLen    - 数据缓冲区长度
  返回值 : >=0 - 数据项值的长度
           -1  - 失败
           -2  - 数据项未找到
******************************************************/
int PGetStr(char *c_pczName,char *c_pczBuf,int c_iBufLen);

/******************************************************
  模块名 : 在POOL池中放入一内存数据
  参  数 : c_pczName    - 数据项的名字
           c_pVal       - 数据项的值
           c_iValLen    - 数据项值的长度
  返回值 : 0  - 成功
           -1 - 失败
******************************************************/
int PPutMem(char *c_pczName,void *c_pVal,int c_iValLen);

/******************************************************
  模块名 : 从POOL池中取出一内存数据
  参  数 : c_pczName    - 数据项的名字
           c_pBuf       - 数据缓冲区
           c_iBufLen    - 数据缓冲区长度
  返回值 : >=0 - 数据项值的长度
           -1  - 失败
           -2  - 数据项未找到
******************************************************/
int PGetMem(char *c_pczName,void *c_pBuf,int c_iBufLen);

/******************************************************
  模块名 : 打印POOL池中的所有数据项
  参  数 : 无
  返回值 : 无
******************************************************/
void POOL_PrintData();

/******************************************************
  模块名 : 在日志文件中打印POOL池中的所有数据项
  参  数 : 无
  返回值 : 无
******************************************************/
void POOL_TraceData();

/******************************************************
  模块名 : 按照定义文件打包表格数据
  参  数 : c_pczFormName -- 表格名
           c_cPrintFlag -- 是否打印表格，'0'-非打印表格，'1'-打印表格，
               对于打印表格，格式文件中的字段定义后加多3列，
               分别为行坐标、列坐标、打印模式
           c_pcBuf -- 输出缓冲区
           c_iBufLen -- 输出缓冲区长度
           c_piRetLen -- 实际表格报文的长度
  返回值 : 0  - 成功
           -1 - 失败
******************************************************/
int SOP_PackForm(char *c_pczFormName,char c_cPrintFlag,
		char *c_pcBuf,int c_iBufLen,int *c_piRetLen);

/******************************************************
  模块名 : 按照定义文件打包表格数据
  参  数 : c_cPrintFlag -- 是否打印表格，'0'-非打印表格，'1'-打印表格
           c_pcPkt -- 表格报文
           c_iPktLen -- 表格报文的长度
  返回值 : 0  - 成功
           -1 - 失败
******************************************************/
int SOP_UnpackForm(char c_cPrintFlag,char *c_pcPkt,int c_iPktLen);

#endif

