#include "tcop.h"

char OP_HOME[64];

int main(int argc, char *argv[])
{
    char *role = "<OperRole><Web>1,03,03_03,07,07_03,11,11_03,11_07,11_11,11_15,11_19,11_23,11_27,11_29</Web><Term>1,1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,1010,1011,1100,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,3000,3001,3002,3003,3004,3005,3006,3007,3008,3009,3010,3011,3012,3013,3014,3015,3016,3017,3018,4000,4001,4002,4003,4004,4005,4006,4007,4008,4009,4010,4011,4012,4013,4014,5000,5001,5002,5003,5004,5005,5006,5007,5008,5009,5010,5011,5012,6000,6001,6002,6003,6004,6005,6006,6007,6008,7000,7001,7002,7003,7004,7005,7006,7007,7008,7009,8000,8001,8002,8003,8004,8005,8006,8007,8008,9000,9001,9002,9003,9004,9005,9006,9007,9008,9100,9101,9102,9103,9104,9105,9106,9107,9108</Term></OperRole>";
    char hint[256] = {0};
    char cliper[33] = {0};
    int ret = 0;

    sprintf(hint, "Usage:%s 地区节点 同城机构号 行内机构号 柜员号 柜员名", argv[0]);
    fprintf(stderr, "%s\n", hint);

    if (argc != 6)
        return 0;

    strcpy(OP_HOME, getenv("HOME"));
    if (db_connect(NULL) != 0)
    {
        fprintf(stderr, "Connect Database Fail.");
        exit(1);
    }

    GenOperPwd(argv[2], argv[4], argv[5], "111111", getDate(0), cliper);

    ret = db_exec("INSERT INTO operinfo VALUES(%s,'%s','%s','%s','%s','%c','%c','%s','%c','%s','%s','%s','%s','%s','%s','%s','%s','%s')", 
            argv[1], argv[4], argv[3], argv[2], argv[5], '1', '1', cliper, '0', getDate(0), 
            "", "", "", "99999999.99", role, "", "", "");

    if (ret != 0)
        fprintf(stderr, "A database's Error has occurred.\n");

    fprintf(stderr, "注册柜员成功!\n");

    db_close(NULL);

    return 0;
}
